Repository: kiss9/kwin-lowlatency
Catalog: po/*/kcm-kwin-scripts.po
Languages: es, pt_br, ru

# NAME OF TRANSLATORS
source: Your names
es: Eloy Cuadra
pt_br: André Marcelo Alvarenga
ru: Светлана Коляда

# EMAIL OF TRANSLATORS
source: Your emails
es: ecuadra@eloihr.net
pt_br: alvarenga@kde.org
ru: kolyadas89@gmail.com

source: KWin Scripts
es: Guiones de KWin
pt_br: Scripts do KWin
ru: Сценарии KWin

source: Configure KWin scripts
es: Configurar los guiones de KWin
pt_br: Configurar os scripts do KWin
ru: Настройка сценариев KWin

source: Tamás Krutki
ru: Тамаш Крутки (Tamás Krutki)

source: Import KWin Script
es: Importar guion de KWin
pt_br: Importar script do KWin
ru: Импорт сценария KWin

source: *.kwinscript|KWin scripts (*.kwinscript)
es: *.kwinscript|Guiones de KWin (*.kwinscript)
pt_br: *.kwinscript|Scripts do KWin (*.kwinscript)
ru: Сценарии KWin (*.kwinscript)

# Placeholder is error message returned from the install service
source: Cannot import selected script. %1
es: No se puede importar el guion. %1
pt_br: Não foi possível importar o script selecionado. %1
ru: Не удалось импортировать выбранный сценарий. %1

# Placeholder is name of the script that was imported
source: The script "%1" was successfully imported.
es: El guion «%1» se ha importado con éxito.
pt_br: O script "%1" foi importado com sucesso.
ru: Сценарий «%1» успешно импортирован.

source: Error when uninstalling KWin Script: %1
es: Ha ocurrido un error al desinstalar el guion de KWin: %1
pt_br: Erro ao desinstalar o script KWin: %1
ru: Ошибка при удалении сценария KWin: %1

source: KWin script configuration
es: Configuración de los guiones de KWin
pt_br: Configuração do script do KWin
ru: Параметры сценария KWin

source: Install from File...
es: Instalar desde archivo...
pt_br: Instalar a partir do arquivo...
ru: Установить из файла...

source: Get New Scripts...
es: Obtener nuevos guiones...
pt_br: Baixar novos scripts...
ru: Загрузить новые сценарии...
