Repository: kiss9/kwin-lowlatency
Catalog: po/*/kcmkwincompositing.po
Languages: ru, zh_cn

source: OpenGL compositing (the default) has crashed KWin in the past. This was most likely due to a driver bug. If you think that you have meanwhile upgraded to a stable driver, you can reset this protection but be aware that this might result in an immediate crash! Alternatively, you might want to use the XRender backend instead.
ru: Ранее графические эффекты OpenGL (по умолчанию) уже приводили к сбою KWin. Скорее всего, это было связано с ошибкой драйвера. Если драйвер уже был обновлён до стабильной версии, то можно сбросить эту за защиту, но помните, что это может привести к немедленному сбою. Как вариант, вместо него можно использовать XRender.
zh_cn: OpenGL 渲染模式 (默认设置) 曾经导致本机的 KWin 崩溃。 该情况可能是当时安装的旧版显示驱动程序的缺陷所致。 如果您的系统已经更新为更加稳定的新版显示驱动程序， 您可以重置此保护措施，但不排除这会导致 KWin 立即崩溃！ 作为替代方案，您可以考虑使用 XRender 渲染后端程序。

source: Scale method "Accurate" is not supported by all hardware and can cause performance regressions and rendering artifacts.
ru: Метод масштабирования «Точное сглаживание» поддерживается не всеми видеокартами и может проводить к ухудшению производительности и артефактам отрисовки.
zh_cn: 并不是所有硬件都能支持“精确”缩放模式，此模式还可能导致性能下降和渲染错误。

source: Keeping the window thumbnail always interferes with the minimized state of windows. This can result in windows not suspending their work when minimized.
ru: Постоянное обновление миниатюр окон требует получения содержимого окна, даже когда оно свёрнуто. Это приводит к тому, что отрисовка в окне не прекращается при сворачивании окна.
zh_cn: 启用保持窗口缩略图功能将影响窗口的最小化状态，可能导致最小化的窗口不能暂停工作。

source: Enable compositor on startup
ru: Включать графические эффекты при входе в систему
zh_cn: 开机时启用显示特效混合器

source: Animation speed:
ru: Скорость анимации:
zh_cn: 动画速度：

source: Very slow
ru: Медленнее
zh_cn: 非常慢

source: Instant
ru: Быстрее
zh_cn: 即时

source: Scale method:
ru: Метод масштабирования:
zh_cn: 缩放模式：

source: Crisp
ru: Простое растяжение пикселов
zh_cn: 锐利

source: Smooth (slower)
ru: Со сглаживанием (медленнее)
zh_cn: 平滑 (较慢)

source: Smooth
ru: Со сглаживанием
zh_cn: 平滑

source: Accurate
ru: Точное сглаживание
zh_cn: 精确

source: Rendering backend:
ru: Механизм отрисовки:
zh_cn: 渲染模式：

source: Tearing prevention ("vsync"):
ru: Предотвращение разрывов (VSync):
zh_cn: 防止撕裂 (垂直同步)：

source: Automatic
ru: Автоматическое
zh_cn: 自动

source: Only when cheap
ru: При минимуме затрат
zh_cn: 只在资源消耗较少时

source: Full screen repaints
ru: Полная перерисовка
zh_cn: 全屏重新绘制

source: Re-use screen content
ru: Повторное использование
zh_cn: 重复利用屏幕内容

source: Keep window thumbnails:
ru: Создавать миниатюры окон:
zh_cn: 保持窗口缩略图：

source: Never
ru: Не создавать
zh_cn: 从不

source: Only for Shown Windows
ru: Только для видимых окон
zh_cn: 只对显示的窗口

source: Always
ru: Для всех окон
zh_cn: 总是

source: Applications can set a hint to block compositing when the window is open. This brings performance improvements for e.g. games. The setting can be overruled by window-specific rules.
ru: Приложения могут рекомендовать выключать графические эффекты, когда открыто их окно. Это помогает улучшить производительность, например, в играх. Этот параметр может быть переопределён отдельно для конкретных окон.
zh_cn: 允许应用程序在窗口打开时阻止特效混合。 此设置可以改善游戏等应用程序的性能。 此设置可被窗口特定规则覆盖。

source: Allow applications to block compositing
ru: Разрешать приложениям блокировать режим с графическими эффектами
zh_cn: 允许应用程序阻止特效混合

source: Latency:
ru: Задержка отрисовки:
zh_cn: 延迟：

source: Force lowest latency (may cause dropped frames)
ru: Принудительно низкая задержка (может привести к артефактам)
zh_cn: 强制最低延迟 (可能会导致掉帧)

source: Prefer lower latency
ru: Предпочитать низкую задержку
zh_cn: 低延迟优先

source: Balance of latency and smoothness
ru: Баланс скорости и плавности
zh_cn: 平衡延迟和显示流畅度

source: Prefer smoother animations
ru: Предпочитать более плавную анимацию
zh_cn: 动效流畅度优先

source: Force smoothest animations
ru: Принудительно наиболее плавная анимация
zh_cn: 强制最流畅动效

source: Re-enable OpenGL detection
ru: Попытаться использовать OpenGL
zh_cn: 重新启用 OpenGL 检测

source: "Only when cheap" only prevents tearing for full screen changes like a video.
ru: В режиме «При минимуме затрат» разрывы предотвращаются только при обновлениях всего экрана, например — при просмотре видео.
zh_cn: “只在资源消耗较少时”只能防止全屏内容变化时造成的撕裂现象，例如在播放视频时。

source: "Full screen repaints" can cause performance problems.
ru: Использование режима «Полная перерисовка» может ухудшать производительность.
zh_cn: “全屏重新绘制”可能导致性能问题。

source: "Re-use screen content" causes severe performance problems on MESA drivers.
ru: Режим «Повторное использование» серьёзно ухудшает производительность при работе с драйверами MESA.
zh_cn: “重复利用屏幕内容”可能会在 MESA 驱动上导致严重的性能问题。
