Repository: kiss9/kwin-lowlatency
Catalog: po/*/kwin_scripting.po
Languages: de, zh_cn

# NAME OF TRANSLATORS
source: Your names
de: Frederik Schwarzer
zh_cn: KDE 中国

# EMAIL OF TRANSLATORS
source: Your emails
de: schwarzer@kde.org
zh_cn: kde-china@kde.org

# Error message
source: Plugin does not provide configuration file in expected location
de: Das Modul liefert am erwarteten Speicherort keine Konfigurationsdatei
zh_cn: 插件未在预期位置提供配置文件

# Assertion failed in KWin script with given value
source: Assertion failed: %1 is not null
de: Assertion fehlgeschlagen: %1 ist nicht Null
zh_cn: 断言失败：%1 非空

# Assertion failed in KWin script
source: Assertion failed: argument is null
de: Assertion fehlgeschlagen: Argument ist Null
zh_cn: 断言失败：参数为空

# Error in KWin Script
source: Invalid number of arguments. At least service, path, interface and method need to be provided
de: Ungültige Anzahl von Argumenten. Mindestens „Service“, „Pfad“, „Interface“ und „Methode“ müssen angegeben werden
zh_cn: 无效的参数数量。至少服务，路径，接口和方法应当提供

# Error in KWin Script
source: Invalid type. Service, path, interface and method need to be string values
de: Ungültiger Typ. „Service“, „Pfad“, „Interface“ und „Methode“ müssen Zeichenfolgen sein
zh_cn: 无效类型。服务，路径，接口和方法应为字符串

# syntax error in KWin script
source: Invalid number of arguments
de: Ungültige Anzahl von Argumenten
zh_cn: 无效的参数数量

# KWin Scripting function received incorrect value for an expected type
source: %1 is not a variant type
de: %1 ist kein Variant-Typ
zh_cn: %1 不是变体类型

# KWin Scripting function received incorrect value for an expected type
source: %1 is not of required type
de: %1 ist nicht vom benötigten Typ
zh_cn: %1 不是所需类型

# KWin Scripting error thrown due to incorrect argument
source: Second argument to registerScreenEdge needs to be a callback
de: Das zweite Argument für registerScreenEdge muss eine Rückruffunktion sein
zh_cn: registerScreenEdge 的第二个参数需要为回调函数

# KWin Scripting error thrown due to incorrect argument
source: Second argument to registerTouchScreenEdge needs to be a callback
de: Das zweite Argument für registerTouchScreenEdge muss eine Rückruffunktion sein
zh_cn: registerTouchScreenEdge 的第二个参数需是一个回调函数

# KWin Scripting error thrown due to incorrect argument
source: Argument for registerUserActionsMenu needs to be a callback
de: Das Argument für registerUserActionsMenu muss eine Rückruffunktion sein
zh_cn: registerUserActionsMenu 的参数需要为回调函数

# Assertion failed in KWin script with given value
source: Assertion failed: %1
de: Assertion fehlgeschlagen: %1
zh_cn: 断言失败：%1

# Assertion failed in KWin script with expected value and actual value
source: Assertion failed: Expected %1, got %2
de: Assertion fehlgeschlagen: %1 erwartet; %2 erhalten
zh_cn: 断言失败：预期 %1，获得 %2
